configuration.org
#+TITLE: Emacs Configuration

* Package Installation
** Load paths for external packages.
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp")
#+END_SRC

** Melpa Package Installers
#+BEGIN_SRC emacs-lisp
 (when (>= emacs-major-version 24)
   (require 'package)
   (package-initialize)
   (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
   )
#+END_SRC
   
* Set personal information
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Bryan W. Roberts"
        user-mail-address "b.w.roberts@lse.ac.uk"
        calendar-latitude 51.5
        calendar-longitude -0.1
        calendar-location-name "London, UK")
#+END_SRC

* Emacs Display Preferences
** Basic appearance

Line wrapping with a hanging indent

#+BEGIN_SRC emacs-lisp
(global-visual-line-mode t)
#+END_SRC

Loading the Melpa-installed theme 'Montekai'

#+BEGIN_SRC emacs-lisp
(require 'color-theme)
(color-theme-initialize)
(load-file "~/.emacs.d/lisp/themes/montekai.el")
(montekai) ;theme
#+END_SRC

Open files in a current emacs buffer instead of in a new emacs window

#+BEGIN_SRC emacs-lisp
(setq dnd-open-file-other-window nil)
(setq ns-pop-up-frames nil)
#+END_SRC

Big pile of customisations

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t) ; no more welcome screen
(global-linum-mode 1) ; linenumbers
(setq linum-format "%d  ") ; linenumber format
(setq-default cursor-type 'bar) ; make cursor a vertical bar
(blink-cursor-mode 1) ; blink the cursor
(require 'paren) ; highlight open/closed parentheses
(show-paren-mode 1) ; turn parentheses mode on, always
(setq show-paren-delay 0) ; show the paren match immediately
;; scroll up/down a line with up and down arrows ;;
(global-set-key [up] (lambda () (interactive) (scroll-down 1)))
(global-set-key [down] (lambda () (interactive) (scroll-up 1)))
(require 'recentf) ;; Obtain a list of recent files wiht C-x C-r
(recentf-mode 1)
(setq recentf-max-menu-items 15)
(global-set-key "\C-x\ \C-r" 'recentf-open-files)
(require 'multiple-cursors) ;; Multiple cursors package!
(global-set-key (kbd "\C-c m") 'mc/edit-lines) ;; multiple cursors cmd
#+END_SRC

** Region-Specific

A key that command that lets you insert a "pound" £ in emacs while on an American keyboard by hitting M-3 (option-3 in my case)

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-3") '(lambda () (interactive) (insert "£")))
#+END_SRC

** Graphical Display Preferences
#+BEGIN_SRC emacs-lisp
;; Things that don't work/matter in the Terminal ;;
 (if (display-graphic-p)
     (progn
     ;; Graphic Display Only Code
       (set-face-attribute 'default nil :height 160) ;font-size
       (tool-bar-mode -1) ;no toolbar
       (set-frame-parameter (selected-frame) 'alpha '(92 90)) ;transparency
       (add-to-list 'default-frame-alist '(alpha 92 90)) ;transparency
       ;;get emacs to find the right path to latex
       ;; (setenv "PATH"
       ;;    (concat
       ;; 	    "/usr/texbin" ":"
       ;; 	    "/usr/local/bin" ":"
       ;; 	    "/usr/local/texlive/2015/bin" ":"
       ;; 	     (getenv "PATH")
       ;; 	  ))
       (setq exec-path (append exec-path '("/usr/local/bin")))
     )
     ;; else (optional)
)
(put 'downcase-region 'disabled nil)
#+END_SRC

** Easier italics, bold, underline

I find it easier to use Apple's Command-i, Command-b, Command-u to set italics, bold, underline. In Org:

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook
   '(lambda ()
        (define-key org-mode-map (kbd "s-i") (kbd "\C-c \C-x \C-f /"))
	(define-key org-mode-map (kbd "s-b") (kbd "\C-c \C-x \C-f *"))
	(define-key org-mode-map (kbd "s-u") (kbd "\C-c \C-x \C-f _"))
    )
)
#+END_SRC

In LaTeX:

#+BEGIN_SRC emacs-lisp
(add-hook 'LaTeX-mode-hook
   '(lambda ()
        (define-key LaTeX-mode-map (kbd "s-i") (kbd "\C-c \C-f \C-e"))
	(define-key LaTeX-mode-map (kbd "s-b") (kbd "\C-c \C-f \C-b"))
    )
)
#+END_SRC

In Markdown:

#+BEGIN_SRC emacs-lisp
(add-hook 'markdown-mode-hook
   '(lambda ()
        (define-key markdown-mode-map (kbd "s-i") (kbd "\C-c \C-s e"))
	(define-key markdown-mode-map (kbd "s-b") (kbd "\C-c \C-s s"))
    )
)
#+END_SRC

In web-mode I'm not sure how to do this, but I'd sure like to!

* Org Mode Configuration
** Loading Org Mode Essentials

Load org and make it the default mode for .org files:

#+BEGIN_SRC emacs-lisp
;; -*- mode: elisp -*-
(require 'org)
(setq org-log-done t)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode)) ;; Make Org mode work with files ending in .org
#+END_SRC

** MobileOrg

MobileOrg lets you view and edit your org files on iOS or Android using the MobilOrg app.

First, set the location of my Org files. For use with the MobileOrg app, we also set the location of the file where new notes will be stored (flagged.org) and the mobile directory (MobileOrg):

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Dropbox/Lists") ; Org directory
(setq org-mobile-inbox-for-pull "~/Dropbox/Lists/flagged.org") ; New notes
(setq org-mobile-directory "~/Dropbox/Apps/MobileOrg") ; MobileOrg directory
#+END_SRC

Your org files have to be transferred over to the folder where the App will view them. This can be done manually by running =org-mobile-push=. But, it's better to automate this. I use Melpa to install the =org-mobile-sync= package, which does this automatically.

** Display Preferences

Fancy bullets using the [[https://github.com/sabof/org-bullets][Org-Bullets]] package, and a downward-pointing arrow instead of ellipses for folded text.

#+BEGIN_SRC emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook
   (lambda ()
      (org-bullets-mode 1)))

(setq org-hide-leading-stars t)
#+END_SRC

Replace the elipses representing folding text with a down-arrow

#+BEGIN_SRC emacs-lisp
  (setq org-ellipsis " ▼")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC

Make TAB act as if it were issued in a buffer of the language's major mode.

#+BEGIN_SRC emacs-lisp
  (setq org-src-tab-acts-natively t)
#+END_SRC

When editing a code snippet, use the current window rather than popping open a
new one (which shows the same information).

#+BEGIN_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
#+END_SRC

Quickly insert a block of elisp by typing <el and then TAB. (This is the general technique for creating expandable snippets in org mode.)

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
#+END_SRC

Standard LaTeX highlighting for mathematics:

#+BEGIN_SRC emacs-lisp
(eval-after-load 'org
  '(setf org-highlight-latex-and-related '(latex)))
#+END_SRC

Make elisp blocks stand out more

#+BEGIN_SRC emacs-lisp

#+END_SRC

** Exporting
*** General

Turn on exporting to Markdown, although we don't use this so much now that we have achieved org-mode Zen.

#+BEGIN_SRC emacs-lisp
  (require 'ox-md)
#+END_SRC

Allow =babel= to evaluate Emacs lisp, Ruby, dot, or Gnuplot code.

#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (ruby . t)
     (dot . t)
     (gnuplot . t)))
#+END_SRC

Don't ask before evaluating code blocks.

#+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

Translate regular ol' straight quotes to typographically-correct curly quotes when exporting.

#+BEGIN_SRC emacs-lisp
  (setq org-export-with-smart-quotes t)
#+END_SRC

*** Exporting to HTML

Remove the crappy default CSS and replace it with my custom stylesheets.

#+BEGIN_SRC emacs-lisp
  (setq org-publish-project-alist
        '(("org"
           :style-include-default nil
           ))
        )
  (setq org-html-head-include-default-style nil)
  (setq org-export-html-style-include-scripts nil)
  (setq org-html-head
        (concat
         "<link rel='stylesheet' type='text/css' href='http://personal.lse.ac.uk/robert49/css/org.css'/>\n"
         "<link rel='stylesheet' href='https://maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css' />"
         )
        )
#+END_SRC

Add a Bootstrap "container" classes to the main content div. We use a filter to go through the html output and add a string in the appropriate place. We add a nice Bootstrap 'table' classes to any tables while we're at it.

#+BEGIN_SRC emacs-lisp
  (defun my-final-filter(output backend info)
    ; Add 'container' classes
    (setq output (replace-regexp-in-string  "div id=\"content\"" "div id=\"content\" class=\"container\"" output ))
    (setq output (replace-regexp-in-string  "class=\"status\"" "class=\"status container\"" output ))
    (setq output (replace-regexp-in-string  "<table" "<table class=\"table table-bordered table-striped\"" output ))
    output
    )
  (setq org-export-filter-final-output-functions  '(my-final-filter) )
#+END_SRC
*** Exporting to LaTeX
We set the default class to be amsart, the standard document type set by the American Mathematical Association (AMS), and choose some standard agreeable packages. Everything here will work for everyone, with the exception of my custom commands input file =BryanCommands=, which can be deleted.

#+BEGIN_SRC emacs-lisp
      (add-to-list 'org-latex-classes
                   '("amsart"
                     "\\documentclass[a4paper]{amsart}
\\usepackage{amsmath,amssymb,amsthm}
\\usepackage{graphicx} \\usepackage[left=1.25in,top=1.4in,right=1.25in,bottom=1.4in,head=0.5in,foot=0.5in]{geometry}
\\usepackage[hidelinks]{hyperref}
\\setlength{\\parindent}{0.5in}
\\usepackage[nodisplayskipstretch]{setspace}
\\setstretch{1.5}
\\input{/bwrtex/BryanCommands}
\\makeatletter
\\let\\uppercasenonmath\\@gobble
\\let\\MakeUppercase\\relax
                     "
                     ("\\section{%s}" . "\\section*{%s}")
                     ("\\subsection{%s}" . "\\subsection*{%s}")
                     ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                     ("\\paragraph{%s}" . "\\paragraph*{%s}")
                     ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
                     )
                   )
      (setq org-latex-default-class "amsart")
#+END_SRC
