oldconfigfiles/configuration.el

(add-to-list 'load-path "~/.emacs.d/lisp")

(when (>= emacs-major-version 24)
  (require 'package)
  (package-initialize)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  )

(setq user-full-name "Bryan W. Roberts"
      user-mail-address "b.w.roberts@lse.ac.uk"
      calendar-latitude 51.5
      calendar-longitude -0.1
      calendar-location-name "London, UK")

(global-visual-line-mode t)

(require 'color-theme)
(color-theme-initialize)
(load-file "~/.emacs.d/lisp/themes/montekai.el")
(montekai) ;theme

(setq dnd-open-file-other-window nil)
(setq ns-pop-up-frames nil)

(setq inhibit-startup-message t) ; no more welcome screen
(global-linum-mode 1) ; linenumbers
(setq linum-format "%d  ") ; linenumber format
(setq-default cursor-type 'bar) ; make cursor a vertical bar
(blink-cursor-mode 1) ; blink the cursor
(require 'paren) ; highlight open/closed parentheses
(show-paren-mode 1) ; turn parentheses mode on, always
(setq show-paren-delay 0) ; show the paren match immediately
;; scroll up/down a line with up and down arrows ;;
(global-set-key [up] (lambda () (interactive) (scroll-down 1)))
(global-set-key [down] (lambda () (interactive) (scroll-up 1)))
(require 'recentf) ;; Obtain a list of recent files wiht C-x C-r
(recentf-mode 1)
(setq recentf-max-menu-items 15)
(global-set-key "\C-x\ \C-r" 'recentf-open-files)
(require 'multiple-cursors) ;; Multiple cursors package!
(global-set-key (kbd "\C-c m") 'mc/edit-lines) ;; multiple cursors cmd

(global-set-key (kbd "M-3") '(lambda () (interactive) (insert "£")))

;; Things that don't work/matter in the Terminal ;;
 (if (display-graphic-p)
     (progn
     ;; Graphic Display Only Code
       (set-face-attribute 'default nil :height 160) ;font-size
       (tool-bar-mode -1) ;no toolbar
       (set-frame-parameter (selected-frame) 'alpha '(92 90)) ;transparency
       (add-to-list 'default-frame-alist '(alpha 92 90)) ;transparency
       ;;get emacs to find the right path to latex
       ;; (setenv "PATH"
       ;;    (concat
       ;;           "/usr/texbin" ":"
       ;;           "/usr/local/bin" ":"
       ;;           "/usr/local/texlive/2015/bin" ":"
       ;;            (getenv "PATH")
       ;;         ))
       (setq exec-path (append exec-path '("/usr/local/bin")))
     )
     ;; else (optional)
)
(put 'downcase-region 'disabled nil)

(add-hook 'org-mode-hook
   '(lambda ()
        (define-key org-mode-map (kbd "s-i") (kbd "\C-c \C-x \C-f /"))
        (define-key org-mode-map (kbd "s-b") (kbd "\C-c \C-x \C-f *"))
        (define-key org-mode-map (kbd "s-u") (kbd "\C-c \C-x \C-f _"))
    )
)

(add-hook 'LaTeX-mode-hook
   '(lambda ()
        (define-key LaTeX-mode-map (kbd "s-i") (kbd "\C-c \C-f \C-e"))
        (define-key LaTeX-mode-map (kbd "s-b") (kbd "\C-c \C-f \C-b"))
    )
)

(add-hook 'markdown-mode-hook
   '(lambda ()
        (define-key markdown-mode-map (kbd "s-i") (kbd "\C-c \C-s e"))
        (define-key markdown-mode-map (kbd "s-b") (kbd "\C-c \C-s s"))
    )
)

;; -*- mode: elisp -*-
(require 'org)
(setq org-log-done t)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode)) ;; Make Org mode work with files ending in .org

(setq org-directory "~/Dropbox/Lists") ; Org directory
(setq org-mobile-inbox-for-pull "~/Dropbox/Lists/flagged.org") ; New notes
(setq org-mobile-directory "~/Dropbox/Apps/MobileOrg") ; MobileOrg directory

(require 'org-bullets)
(add-hook 'org-mode-hook
   (lambda ()
      (org-bullets-mode 1)))

(setq org-hide-leading-stars t)

(setq org-ellipsis " ▼")

(setq org-src-fontify-natively t)

(setq org-src-tab-acts-natively t)

(setq org-src-window-setup 'current-window)

(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))

(eval-after-load 'org
  '(setf org-highlight-latex-and-related '(latex)))



(require 'ox-md)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (ruby . t)
   (dot . t)
   (gnuplot . t)))

(setq org-confirm-babel-evaluate nil)

(setq org-export-with-smart-quotes t)

(setq org-publish-project-alist
      '(("org"
         :style-include-default nil
         ))
      )
(setq org-html-head-include-default-style nil)
(setq org-export-html-style-include-scripts nil)
(setq org-html-head
      (concat
       "<link rel='stylesheet' type='text/css' href='http://personal.lse.ac.uk/robert49/css/org.css'/>\n"
       "<link rel='stylesheet' href='https://maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css' />"
       )
      )

(defun my-final-filter(output backend info)
  ; Add 'container' classes
  (setq output (replace-regexp-in-string  "div id=\"content\"" "div id=\"content\" class=\"container\"" output ))
  (setq output (replace-regexp-in-string  "class=\"status\"" "class=\"status container\"" output ))
  (setq output (replace-regexp-in-string  "<table" "<table class=\"table table-bordered table-striped\"" output ))
  output
  )
(setq org-export-filter-final-output-functions  '(my-final-filter) )

(add-to-list 'org-latex-classes
                   '("amsart"
                     "\\documentclass[a4paper]{amsart}
\\usepackage{amsmath,amssymb,amsthm}
\\usepackage{graphicx} \\usepackage[left=1.25in,top=1.4in,right=1.25in,bottom=1.4in,head=0.5in,foot=0.5in]{geometry}
\\usepackage[hidelinks]{hyperref}
\\setlength{\\parindent}{0.5in}
\\usepackage[nodisplayskipstretch]{setspace}
\\setstretch{1.5}
\\input{/bwrtex/BryanCommands}
\\makeatletter
\\let\\uppercasenonmath\\@gobble
\\let\\MakeUppercase\\relax
                     "
                     ("\\section{%s}" . "\\section*{%s}")
                     ("\\subsection{%s}" . "\\subsection*{%s}")
                     ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                     ("\\paragraph{%s}" . "\\paragraph*{%s}")
                     ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
                     )
                   )
      (setq org-latex-default-class "amsart")
