configuration.org
* Markdown

I don't use Markdown so much anymore after having discovered Org, but I keep it around because I have a lot of old files written in Markdown.

To compile with Markdown, you have to first install it. I do this using Homebrew by running ~brew install markdown~. We will automatically load Markdown and use it for .txt, .markdown, and .md files:

#+BEGIN_SRC emacs-lisp
(autoload 'markdown-mode "markdown-mode"
   "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist '("\\.txt\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
(add-hook 'markdown-mode-hook 'visual-line-mode) ; line wrapping
#+END_SRC

Then we customise how the Markdown is displayed to make it look a little nicer.

#+BEGIN_SRC emacs-lisp
(custom-set-faces
 '(fringe ((t (:background "#272821"))))
 '(markdown-header-delimiter-face ((t (:inherit font-lock-function-name-face :underline t :weight bold))) t)
 '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.5))) t)
 '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.3))) t)
 '(markdown-header-face-3 ((t (:inherit markdown-header-face :underline t :height 1.2))) t)
 '(markdown-header-face-4 ((t (:inherit markdown-header-face :underline t :height 1.1))) t)
 '(markdown-header-face-5 ((t (:inherit markdown-header-face :underline t))) t)
 '(markdown-header-face-6 ((t (:inherit markdown-header-face :underline t))) t))
(put 'set-goal-column 'disabled nil)
#+END_SRC

* HTML editing

Emacs by default uses an html-mode that is pretty weak. It's way better to use web-mode. I require this, and use it to open standard html files:

#+BEGIN_SRC emacs-lisp
(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[gj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))

;; SVG viewing and editing
(require 'nxml-mode)
(add-to-list 'rng-schema-locating-files
             "~/.emacs.d/xml-schemas/schemas.xml"
             t)
(define-key nxml-mode-map "\M- " 'completion-at-point)
#+END_SRC

* Emacs Cross-Machine Syncing

I keep my =.emacs.d= file with all my packages and configurations in a visible Dropbox folder that I can sync with all my machines, and then use a symbolic link to it in my home directory. The symbolic link is created by going to the terminal and entering,

~ln -s ~/Dropbox/emacs.d ~/.emacs.d~

I use the same trick to sync the custom additions to my aspell dictionary across machines.

~ln -s ~/Dropbox/emacs-aspell-dict ~/.aspell.en.pws~

To not add all the emacs auto-saving and backups to Dropbox's syncing tasks, I also use the following to place these in a =tmp= folder in my root directory. (Actually I have to check that this works, and don't feel like tinkering with it right now.)

#+BEGIN_SRC emacs-lisp
;    (add-to-list 'auto-save-file-name-transforms '("\\`.*/Dropbox/.*" "/tmp/" t))
;    (add-to-list 'backup-directory-alist '("\\`.*/Dropbox/.*" . "/tmp/"))
#+END_SRC
* Bug-fixes
For some reason if I closed the emacs window using the mouse, it would produce a pop-up dialogue that would crash emacs. The code below prevents this from happening. (That was emacs 24 though, so it may not be necessary anymore.)

#+BEGIN_SRC emacs-lisp
(defadvice yes-or-no-p (around prevent-dialog activate)
  "Prevent yes-or-no-p from activating a dialog"
  (let ((use-dialog-box nil))
    ad-do-it))
(defadvice y-or-n-p (around prevent-dialog-yorn activate)
  "Prevent y-or-n-p from activating a dialog"
  (let ((use-dialog-box nil))
    ad-do-it))

#+END_SRC
